/*---------------------------------------------------------------------*
config.h
*---------------------------------------------------------------------*/

#ifndef        __CONFIG_H
#define        __CONFIG_H

/*---------------------------------------------------------
设置
----------------------------------------------------------*/
#define MAIN_Fosc           11059200UL    //定义主时钟
//#define MAIN_Fosc           22118400UL    //定义主时钟
//#define MAIN_Fosc           24000000UL    //定义主时钟

#define USE_Extern_Fosc         0           //0使用内部IRC 1使用外部时钟

#define USE_STCISP_MOMITORING   1           //启用ISP下载监控
#define STCISP_KEYWORDS_COUNT   64          //监控重复数据计数


/*---------------------------------------------------------
头文件
----------------------------------------------------------*/
#include    "stc32g.h"
#include    <INTRINS.H>
#include    "type_def.h"
#include    <stdlib.h>
#include    <stdio.h>
#include    <string.h>
#include    <ucos_ii.h>




/*---------------------------------------------------------
位
----------------------------------------------------------*/
#define BIT(X)  (1UL<<X)


/*---------------------------------------------------------
GPIO
----------------------------------------------------------*/





#endif
